testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_1____loss-rate-percent_1____clients-requests_10/2/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 219.45ms, 45.57 req/s, 43.47MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 697 sent, 8251 received
                     min         max         mean         sd        +/- sd
time for request:    33.65ms    202.88ms    100.08ms     57.82ms    70.00%
time for connect:     6.17ms     28.54ms     17.02ms      7.62ms    60.00%
time to 1st byte:    28.53ms     31.25ms     29.74ms       984us    60.00%
req/s           :       4.58       16.17       10.38        4.58    50.00%